PH_data/alpha_0.8/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
15041
(
( 0.02705189958 0.002354046796 0.0001820634498 )
( 0.02718725801 0.002057472244 0.0001390547695 )
( 0.02743281052 0.002139651449 0.0002049028117 )
( 0.02729879878 0.001765971771 0.0001200834304 )
( 0.02755877748 0.001914234948 0.0001930831058 )
( 0.02784010023 0.001972592901 0.0002050818584 )
( 0.02736908197 0.001519729383 0.0001054070672 )
( 0.02767699771 0.001666528173 0.0001775741985 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
